#include "std_lib_facilities.h"
int main(){
    cout << "Дверь - предмет прямоугольной формы, который можно открыть и пройти сквозь стену\
    \nСтена - это преграда через которую не пройти\
    \nФокусируемся на ручку двери(выпирающий предмет в двери)\
    \nОткрываем дверь\
    \nИдем прямо, пока стена(преграда, мешающая пройти вперед),которая перед тобой, не окажется на расстояний 2 метра\
    \nПоворачиваемся на 90 градусо направо\
    \nСчитаем количество лесенок\
    \nСколько лесенок, столько и шагов мы делаем вперед, поднимая ногу чуть выше обычного\
    \nКогда лестница пройдена, поворачиваемся на 90 градусо налево,\
    \nдверь спереди есть конец пути\
    \n";
    keep_window_open();
    return 0;
}